Repository: b-kucherepa/habit_to_do_some_level_up
Catalog: lib/l10n/app_*.arb
Languages: he, hy

# appTitle
source: RPG Todo & Habits
he: RPG משימות והרגלים
hy: Սովորություն՝ Կյանքը Մակարդակ Բարձրացնելու համար

source: Home
he: בית
hy: Գլխավոր

source: Settings
he: הגדרות
hy: Կարգավորումներ

source: Add Habit
he: הוסף הרגל
hy: Ավելացնել Սովորություն

source: Add Task
he: הוסף משימה
hy: Ավելացնել Առաջադրանք

source: Edit Habit
he: ערוך הרגל
hy: Փոփոխել Սովորությունը

source: Edit Task
he: ערוך משימה
hy: Փոփոխել Առաջադրանքը

source: Delete
he: מחק

source: Edit
he: ערוך

source: To Next
he: לבא
hy: Դեպի Հաջորդը

source: Habit Title
he: כותרת הרגל

# completeDayHint
source: Complete Missed Day
he: השלם יום שהחמצת
hy: Կատարել Բաց Թողած Օրը

# markCompletedHabitsHint
source: Mark completed habits for this day:
he: סמן הרגלים שהושלמו עבור יום זה:
hy: Նշել այս օրվա կատարված սովորությունները՝

# skipDayButton
source: Skip This Day
he: דלג על יום זה
hy: Բաց Թողնել Օրը

# completeDayButton
source: Complete Day
he: השלם יום
hy: Ավարտել Օրը

# habitDescription
source: Description
he: תיאור

source: Experience Points
he: נקודות ניסיון

source: Min Completion Count
he: מספר השלמות מינימלי

source: Schedule Type
he: סוג לוח זמנים
hy: Ժամանակացույցի Տեսակը

source: Daily
he: יומי

source: Weekly
he: שבועי

source: Monthly
he: חודשי

source: Custom
he: מותאם

source: Select days
he: בחר ימים

source: Monday
he: יום שני

source: Tuesday
he: יום שלישי

source: Wednesday
he: יום רביעי

source: Thursday
he: יום חמישי

source: Friday
he: יום שישי

source: Saturday
he: יום שבת

source: Sunday
he: יום ראשון

source: Habits
he: הרגלים
hy: Սովորություններ

source: Habits Done
he: הרגלים שהושלמו
hy: Կատարված Սովորություններ

source: Tasks
he: משימות
hy: Առաջադրանքներ

source: Tasks Due
he: משימות שצריך להשלים
hy: Պարտադիր Առաջադրանքներ

source: Tasks Done
he: משימות שהושלמו
hy: Կատարված Առաջադրանքներ

source: Level
he: דרגה
hy: Մակարդակ

source: {habitsNumber} today
he: {habitsNumber} היום

source: Today's Progress
he: התקדמות היום
hy: Այսօրվա Առաջընթացը

source: Experience
he: ניסיון

# experienceShort
source: EXP
he: ניסיון
hy: Փ

source: Congratulations!
he: מזל טוב!
hy: Շնորհավորում ենք

# levelReached
source: Level {level} reached!
he: הגעת לדרגה {level}!
hy: Հասել եք {level}-րդ մակարդակին

# continueButton
source: Continue
he: המשך
hy: Շարունակել

# dontForgetToUseAchievenents
source: Don't forget to use your achievements to {goal}!
he: אל תשכח להשתמש בהישגים שלך כדי {goal}!
hy: Մի մոռացեք օգտագործել ձեր նվաճումները... {goal}-ի համար

# expCurveLabel
source: Curve Exponent: {exponent}, Multiplier: {multiplier}
he: מעריך עקומה: {exponent}, מכפיל: {multiplier}

source: Goal
he: מטרה
hy: Նպատակ

# defaultGoal
source: Accumulate experience for your RPG journey!
he: צבור ניסיון כדי ליצור את דמות ה-RPG שלך!
hy: Բարձրացրու քո կյանքի մակարդակը

source: Progress
he: התקדמות

source: Progress to Level
he: התקדמות לדרגה

source: Completed
he: הושלם

source: Pending
he: ממתין

source: Overdue
he: איחור
hy: Հարկադիր հետաձգված

source: Due Today
he: צריך להשלים היום

source: Due Soon
he: יצטרך להשלים בקרוב

source: Karma
he: קרמה

source: Karma Level
he: דרגת קרמה

# karmaDescription
source: Your karma level reflects your consistency.
he: דרגת הקרמה שלך משקפת את העקביות שלך.

source: Reset Progress
he: אפס התקדמות
hy: Վերականգնել Առաջընթացը

# resetProgressTitle
source: Reset Progress?
he: לאפס התקדמות?

# resetProgressDescription
source: This action will permanently reset:
he: פעולה זו תאפס לצמיתות:

# resetWarningExperience
source: All character experience and level
he: כל הניסיון והדרגה של הדמות

# resetWarningHabits
source: Completion history of all habits
he: היסטוריית ההשלמה של כל ההרגלים

# resetWarningKarma
source: Karma levels of all habits
he: דרגות הקרמה של כל ההרגלים

# resetTasksUnaffected
source: Tasks will not be affected.
he: משימות לא יושפעו.

# resetCannotUndone
source: This action cannot be undone!
he: לא ניתן לבטל פעולה זו!

# resetCancel
source: Cancel
he: בטל

# resetConfirm
source: Reset Progress
he: אפס התקדמות

# resetSuccess
source: Progress has been reset successfully!
he: ההתקדמות אופסה בהצלחה!
hy: Առաջընթացի տվյալները հաջողությամբ վերականգնվել են

source: Progress Settings
he: הגדרות התקדמות

source: Goal Motivation
he: מוטיבציית מטרה
hy: Նպատակի Մոտիվացիա

# goalMotivationHint
source: What are you accumulating experience for?
he: למה אתה צובר ניסיון?
hy: Ինչի՞ համար եք փորձ ձեռք բերում

source: Language
he: שפה
hy: Լեզու

source: English
he: אנגלית
hy: Անգլերեն

source: Russian
he: רוסית
hy: Ռուսերեն

source: German
he: גרמנית
hy: Գերմաներեն

source: French
he: צרפתית
hy: Ֆրանսերեն

source: Spanish
he: ספרדית
hy: Իսպաներեն

source: Portuguese
he: פורטוגזית
hy: Պորտուգալերեն

source: Chinese
he: סינית
hy: Չինարեն

source: Japanese
he: יפנית
hy: Ճապոներեն

source: Korean
he: קוריאנית
hy: Կորեերեն

source: Hindi
he: הינדי
hy: Հինդի

source: Arabic
he: ערבית
hy: Արաբերեն

source: Hebrew
he: עברית
hy: Եբրայերեն

source: Curve Exponent
he: מעריך עקומה
hy: Կորի Արտահայտիչ

# curveExponentDescription
source: Curve exponent: {exponent}. Values <1 make early levels easier, >1 make later levels easier
he: מעריך עקומה: {exponent}. ערכים קטנים מ-1 מקלים על דרגות ראשונות, גדולים מ-1 מקלים על דרגות מתקדמות
hy: Կորի արտահայտիչ՝ {exponent}: Արժեքները <1-ը հեշտացնում են սկզբնական մակարդակները, >1-ը՝ հեշտացնում են ուշ մակարդակները

source: Experience Multiplier
he: מכפיל ניסיון
hy: Փորձի Բազմապատկիչ

# experienceMultiplierDescription
source: Experience multiplier: {multiplier}. Higher values make leveling slower
he: מכפיל ניסיון: {multiplier}. ערכים גבוהים יותר מאטים את העליה בדרגה
hy: Փորձի բազմապատկիչ՝ {multiplier}: Բարձր արժեքները դանդաղեցնում են մակարդակի բարձրացումը

source: Level Progression Preview:
he: תצוגה מקדימה להתקדמות בדרגה:
hy: Մակարդակի Առաջընթացի Նախադիտում

# levelFormula
source: Formula: EXP = {multiplier} × (Level-1)^{exponent}
he: נוסחה: ניסיון = {multiplier} × (דרגה-1)^{exponent}
hy: Բանաձև՝ Փորձ = {multiplier} × (Մակարդակ-1)^{exponent}

source: Cancel
he: בטל
hy: Չեղարկել

source: Save
he: שמור
hy: Պահպանել

# habitFormTitle
source: Habit Title
he: כותרת הרגל
hy: Սովորության Անվանում

# habitFormTitleError
source: Please enter a title
he: נא להזין כותרת
hy: Խնդրում ենք նշել անվանում

# habitFormDescription
source: Description
he: תיאור
hy: Նկարագրություն

# habitFormExperience
source: Experience Points
he: נקודות ניסיון
hy: Փորձի Միավորներ

# habitFormExperienceError
source: Please enter experience
he: נא להזין ניסיון
hy: Խնդրում ենք նշել փորձ

# habitFormNumberError
source: Please enter a valid number
he: נא להזין מספר תקין
hy: Խնդրում ենք նշել վավեր թիվ

# habitFormMinCompletion
source: Min Completion
he: השלמות מינימליות
hy: Նվազագույն Կատարում

# habitFormMinCompletionError
source: Please enter min count
he: נא להזין מספר מינימלי
hy: Խնդրում ենք նշել նվազագույն քանակ

# habitFormMinCountError
source: At least 1
he: לפחות 1
hy: Առնվազն 1

# habitFormUpdate
source: Update Habit
he: עדכן הרגל
hy: Թարմացնել Սովորությունը

# habitFormSave
source: Save Habit
he: שמור הרגל
hy: Պահպանել Սովորությունը

# habitFormWeeklyError
source: Please select at least one day for weekly schedule
he: נא לבחור לפחות יום אחד ללוח זמנים שבועי
hy: Խնդրում ենք ընտրել առնվազն մեկ օր շաբաթական ժամանակացույցի համար

# habitFormMonthlyError
source: Please select at least one day for monthly schedule
he: נא לבחור לפחות יום אחד ללוח זמנים חודשי
hy: Խնդրում ենք ընտրել առնվազն մեկ օր ամսական ժամանակացույցի համար

# habitFormCustomError
source: Please select interval for custom schedule
he: נא לבחור מרווח ללוח זמנים מותאם
hy: Խնդրում ենք ընտրել միջակայք հատուկ ժամանակացույցի համար

# habitItemExperience
source: {experience} XP
he: {experience} נק' ניסיון
hy: {experience} Փ

# habitItemMinCompletion
source: min {minCompletionCount}
he: מינימום {minCompletionCount}
hy: նվազ. {minCompletionCount}

# habitItemTodayCount
source: {currentCount} today
he: {currentCount} היום

# habitItemNotToday
source: Not today
he: לא היום

# habitItemEditTooltip
source: Edit habit
he: ערוך הרגל
hy: Փոփոխել սովորությունը

# habitItemDeleteTooltip
source: Delete habit
he: מחק הרגל
hy: Ջնջել սովորությունը

# habitItemScheduleDaily
source: Daily
he: יומי
hy: օրեկան

# habitItemScheduleWeekly
source: Weekly
he: שבועי
hy: շաբաթական

# habitItemScheduleMonthly
source: Monthly
he: חודשי
hy: ամսական

# habitItemScheduleCustom
source: Custom
he: מותאם
hy: հատուկ

# habitItemDeleteConfirmationTitle
source: Delete Habit
he: מחק הרגל
hy: Ջնջել Սովորությունը

# habitItemDeleteConfirmationMessage
source: Are you sure you want to delete "{habitTitle}"?
he: האם אתה בטוח שברצונך למחוק "{habitTitle}"?
hy: Համոզված ե՞ք, որ ցանկանում եք ջնջել "{habitTitle}"-ը

# habitItemDeleteConfirmationWarning
source: ⚠️ This will remove {xpAmount} XP from your character!
he: ⚠️ פעולה זו תסיר {xpAmount} נקודות ניסיון מהדמות שלך!
hy: ⚠️ Սա կհեռացնի {xpAmount} Փորձ ձեր խաղացողից

# habitItemDeleteConfirmationCancel
source: Cancel
he: בטל
hy: Չեղարկել

# habitItemDeleteConfirmationDelete
source: Delete
he: מחק
hy: Ջնջել

# habitsTabEmptyTitle
source: No habits yet!
he: אין עדיין הרגלים!
hy: Դեռ սովորություններ չկան

# habitsTabEmptySubtitle
source: Tap the + button to add your first habit
he: הקש על כפתור + כדי להוסיף את ההרגל הראשון שלך
hy: Սեղմեք + կոճակը ձեր առաջին սովորությունը ավելացնելու համար

# taskFormTitle
source: Task Title
he: כותרת משימה
hy: Առաջադրանքի Անվանում

# taskFormTitleError
source: Please enter a title
he: נא להזין כותרת
hy: Խնդրում ենք նշել անվանում

# taskFormDescription
source: Description
he: תיאור
hy: Նկարագրություն

# taskFormExperience
source: Experience Points
he: נקודות ניסיון
hy: Փորձի Միավորներ

# taskFormExperienceError
source: Please enter experience
he: נא להזין ניסיון
hy: Խնդրում ենք նշել փորձ

# taskFormNumberError
source: Please enter a valid number
he: נא להזין מספר תקין
hy: Խնդրում ենք նշել վավեր թիվ

# taskFormDueDateLabel
source: Due Date: {date}
he: תאריך יעד: {date}
hy: Վերջնաժամկետ՝ {date}

# taskFormSelectDate
source: Select Date
he: בחר תאריך
hy: Ընտրել Ամսաթիվ

# taskFormPriorityLabel
source: Priority: {priority}
he: עדיפות: {priority}
hy: Առաջնահերթություն՝ {priority}

# taskFormCategory
source: Category
he: קטגוריה
hy: Կատեգորիա

# taskFormUpdate
source: Update Task
he: עדכן משימה
hy: Թարմացնել Առաջադրանքը

# taskFormSave
source: Save Task
he: שמור משימה
hy: Պահպանել Առաջադրանքը

# taskCategoryWork
source: Work
he: עבודה
hy: Աշխատանք

# taskCategoryPersonal
source: Personal
he: אישי
hy: Անձնական

# taskCategoryHealth
source: Health
he: בריאות
hy: Առողջություն

# taskCategoryLearning
source: Learning
he: למידה
hy: Ուսուցում

# taskCategoryOther
source: Other
he: אחר
hy: Այլ

# tasksTabEmptyTitle
source: No tasks yet!
he: אין עדיין משימות!
hy: Դեռ առաջադրանքներ չկան

# tasksTabEmptySubtitle
source: Tap the + button to add your first task
he: הקש על כפתור + כדי להוסיף את המשימה הראשונה שלך
hy: Սեղմեք + կոճակը ձեր առաջին առաջադրանքը ավելացնելու համար

# tasksTabTotal
source: Total
he: סה"כ

# tasksTabPending
source: Pending
he: ממתינות

# tasksTabDone
source: Done
he: הושלמו

# tasksTabPendingHeader
source: Pending Tasks ({count})
he: משימות ממתינות ({count})

# tasksTabCompletedHeader
source: Completed Tasks ({count})
he: משימות שהושלמו ({count})
hy: Կատարված Առաջադրանքներ

# tasksTabExperience
source: {experience} XP
he: {experience} נק' ניסיון
hy: {experience} Փ

# tasksTabEditTooltip
source: Edit task
he: ערוך משימה
hy: Փոփոխել առաջադրանքը

# tasksTabDeleteTooltip
source: Delete task
he: מחק משימה
hy: Ջնջել առաջադրանքը

# tasksTabDeleteConfirmationTitle
source: Delete Task
he: מחק משימה
hy: Ջնջել Առաջադրանքը

# tasksTabDeleteConfirmationMessage
source: Are you sure you want to delete "{taskTitle}"?
he: האם אתה בטוח שברצונך למחוק "{taskTitle}"?
hy: Համոզված ե՞ք, որ ցանկանում եք ջնջել "{taskTitle}"-ը

# tasksTabDeleteConfirmationWarning
source: ⚠️ This will remove {xpAmount} XP from your character!
he: ⚠️ פעולה זו תסיר {xpAmount} נקודות ניסיון מהדמות שלך!
hy: ⚠️ Սա կհեռացնի {xpAmount} Փորձ ձեր խաղացողից

# tasksTabDeleteConfirmationCancel
source: Cancel
he: בטל
hy: Չեղարկել

# tasksTabDeleteConfirmationDelete
source: Delete
he: מחק
hy: Ջնջել

# tasksTabDueToday
source: Today
he: היום
hy: Այսօր

# tasksTabDueTomorrow
source: Tomorrow
he: מחר
hy: Վաղը

# tasksTabDueYesterday
source: Yesterday
he: אתמול
hy: Երեկ

# tasksTabDueDaysAgo
source: {days} days ago
he: לפני {days} ימים
hy: {days} օր առաջ

# tasksTabDueInDays
source: In {days} days
he: בעוד {days} ימים
hy: {days} օրից

# scheduleSelectorTitle
source: Schedule Type
he: סוג לוח זמנים
hy: Ժամանակացույցի Տեսակը

# scheduleTypeDaily
source: Daily
he: יומי
hy: Օրեկան

# scheduleTypeWeekly
source: Weekly
he: שבועי
hy: Շաբաթական

# scheduleTypeMonthly
source: Monthly
he: חודשי
hy: Ամսական

# scheduleTypeCustom
source: Custom Interval
he: מרווח מותאם
hy: Հատուկ Միջակայք

# scheduleWeeklyTitle
source: Select days:
he: בחר ימים:
hy: Ընտրեք օրերը.

# scheduleMonthlyTitle
source: Select days of month:
he: בחר ימים בחודש:
hy: Ընտրեք ամսվա օրերը.

# scheduleCustomTitle
source: Repeat every X days:
he: חזור כל X ימים:
hy: Կրկնել ամեն X օրը.

# scheduleCustomInterval
source: {days, plural, one{1 day} other{{days} days}}
he: {days, plural, one{יום 1} other{{days} ימים}}
hy: {days, plural, one{1 օր} other{{days} օր}}

# scheduleCustomError
source: Please select interval
he: נא לבחור מרווח
hy: Խնդրում ենք ընտրել միջակայք

# weekdayMonday
source: Mon
he: ב'
hy: Երկ

# weekdayTuesday
source: Tue
he: ג'
hy: Երք

# weekdayWednesday
source: Wed
he: ד'
hy: Չոր

# weekdayThursday
source: Thu
he: ה'
hy: Հինգ

# weekdayFriday
source: Fri
he: ו'
hy: Ուրբ

# weekdaySaturday
source: Sat
he: ש'
hy: Շաբ

# weekdaySunday
source: Sun
he: א'
hy: Կիր
